app/controllers/users_controller.rb

UPDATE "users" SET "name" = 'Jim Fiser', "password_digest" = '$2a$10$HnXvnGqdgrvrj8P3d9LzCO1Hv4thlyS3CR40YSHI/EMU3jg2tLSYm', "remember_token" = 'fG7A1uS3SiGkOzKebLsSBQ', "updated_at" = '2013-09-02 14:38:48.923121' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])